*** crates/asf-kernel/src/broker.rs:879:5: replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([(String::new(), 0)])

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([(String::new(), 0)])
@@ -871,28 +871,17 @@
 /// A21/M7 activation view: the earliest verified grant offset for each
 /// capability bound to this manifest. Kept as a small pure helper so the
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
-    let mut grants = BTreeMap::new();
-    for ev in events {
-        if ev.span == substrate_span
-            && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
-        {
-            if let Some(cap) = ev.raw["body"]["capability"].as_str() {
-                grants.entry(cap.to_string()).or_insert(ev.offset);
-            }
-        }
-    }
-    grants
+    BTreeMap::from_iter([(String::new(), 0)]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve the capability claimed by one effect. Observed mode may carry an
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9125649) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:59f2ca3c1d207c8288b9dd87757ce5fd63d37d5b38ba4a6d2cedccea23951781: no verified grant event binds cap:59fc70918611864b239f059c1f60779876e9acb5289b8bf5087e5ab7fc650c86 to this manifest (M7)

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9125640) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:7dd5156493fa34b1a54a7183bf5af4ed611d31f17effc13504392c2117f6aff9: no verified grant event binds cap:984b9fd51ce911f16d76de3952848d15e51f3088e8430ce79cc14edf961bb447 to this manifest (M7)

---- a22_anomalous_manifest_revoke_still_closes_loudly stdout ----

thread 'a22_anomalous_manifest_revoke_still_closes_loudly' (9125642) panicked at crates/asf-kernel/tests/gate.rs:1381:59:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:e5d4a7ade7a535c50df4f0cdded32d9cf17ca7bc3a1d32099f2521901f2a1453: no verified grant event binds cap:1a1675b4c9ebf4e2739911f8b97288dc132d10c0525d7055c344735addf0df8d to this manifest (M7)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.23s

*** result: Failure(101)
