*** crates/asf-kernel/src/broker.rs:879:5: replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([(String::new(), 1)])

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([(String::new(), 1)])
@@ -871,28 +871,17 @@
 /// A21/M7 activation view: the earliest verified grant offset for each
 /// capability bound to this manifest. Kept as a small pure helper so the
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
-    let mut grants = BTreeMap::new();
-    for ev in events {
-        if ev.span == substrate_span
-            && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
-        {
-            if let Some(cap) = ev.raw["body"]["capability"].as_str() {
-                grants.entry(cap.to_string()).or_insert(ev.offset);
-            }
-        }
-    }
-    grants
+    BTreeMap::from_iter([(String::new(), 1)]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve the capability claimed by one effect. Observed mode may carry an
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9119573) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:a5f9767680e9048a28c8257925546cd4f34541220062986ab8ecd7a2c94826d4: no verified grant event binds cap:5fa9aa1130db351aac58deca524e6630a32a02f0a9f3852dde2769b1c92d32c4 to this manifest (M7)

---- a22_pre_revoke_work_promotes_after_revoke stdout ----

thread 'a22_pre_revoke_work_promotes_after_revoke' (9119581) panicked at crates/asf-kernel/tests/gate.rs:1173:58:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:2a1ece17fd6d9542dfc5b4ee4522ad83feac3f49e1663cbcf66e7053a1d763d6: no verified grant event binds cap:cefc9037e50a818ac7fef48550432b95039a3b5012b2f5696f743a262ee50197 to this manifest (M7)")

---- a22_anomalous_manifest_revoke_still_closes_loudly stdout ----

thread 'a22_anomalous_manifest_revoke_still_closes_loudly' (9119575) panicked at crates/asf-kernel/tests/gate.rs:1381:59:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:fcf58684f749702f8f8026bd3e9651754e63c9d408551926961dfb03789506e6: no verified grant event binds cap:c839ebedb4b7516bb18221de5cdbee95f133fad52e392aff45801aa5b78e4a7c to this manifest (M7)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.69s

*** result: Failure(101)
