*** crates/asf-kernel/src/broker.rs:879:5: replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([(String::new(), -1)])

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([(String::new(), -1)])
@@ -871,28 +871,17 @@
 /// A21/M7 activation view: the earliest verified grant offset for each
 /// capability bound to this manifest. Kept as a small pure helper so the
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
-    let mut grants = BTreeMap::new();
-    for ev in events {
-        if ev.span == substrate_span
-            && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
-        {
-            if let Some(cap) = ev.raw["body"]["capability"].as_str() {
-                grants.entry(cap.to_string()).or_insert(ev.offset);
-            }
-        }
-    }
-    grants
+    BTreeMap::from_iter([(String::new(), -1)]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve the capability claimed by one effect. Observed mode may carry an
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9125673) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:742d4c2783db8d21a138dc396878e52f63dd4166977e80e53a3ca2f5f0b05caf: no verified grant event binds cap:0c4b5720e63eb7d97791464cd5fe0c7a622eca1f1e6e83ac9806fd0e60e5077b to this manifest (M7)

---- a22_anomalous_manifest_revoke_still_closes_loudly stdout ----

thread 'a22_anomalous_manifest_revoke_still_closes_loudly' (9125675) panicked at crates/asf-kernel/tests/gate.rs:1381:59:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:ecfc522330900c8cbc7a5e8da15b1b99eea9da46bcfd018d5641af25dc90a65f: no verified grant event binds cap:0ff9d4c53fd12f3e3c07ab6d9fbe61785da214935540b1535f657766f081af27 to this manifest (M7)")

---- a22_pre_revoke_work_promotes_after_revoke stdout ----

thread 'a22_pre_revoke_work_promotes_after_revoke' (9125681) panicked at crates/asf-kernel/tests/gate.rs:1173:58:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:ba3496c65ed882b9a9ecc6cd2f78c2ed8e446e9c3338a87ddba2d1a493319dcf: no verified grant event binds cap:ba4316e322b53ee633a100823d776b52dea5d3cde411cdc90923588d0916382f to this manifest (M7)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.10s

*** result: Failure(101)
