*** crates/asf-kernel/src/broker.rs:879:5: replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([("xyzzy".into(), 0)])

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([("xyzzy".into(), 0)])
@@ -871,28 +871,17 @@
 /// A21/M7 activation view: the earliest verified grant offset for each
 /// capability bound to this manifest. Kept as a small pure helper so the
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
-    let mut grants = BTreeMap::new();
-    for ev in events {
-        if ev.span == substrate_span
-            && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
-        {
-            if let Some(cap) = ev.raw["body"]["capability"].as_str() {
-                grants.entry(cap.to_string()).or_insert(ev.offset);
-            }
-        }
-    }
-    grants
+    BTreeMap::from_iter([("xyzzy".into(), 0)]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve the capability claimed by one effect. Observed mode may carry an
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,

---- a22_inflight_ticket_recorded_after_revoke_strands_branch stdout ----

thread 'a22_inflight_ticket_recorded_after_revoke_strands_branch' (9119292) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:8cb94d4510631bdeb4ac913562d53d1be88ce82cc9878b0314de38bd698d2345: no verified grant event binds cap:81aaf28bd2cb6f8e20308bbe82b94b9701e75d91b30b939b886d326254f3811a to this manifest (M7)

---- a22_effect_recorded_after_revoke_fails_gate stdout ----

thread 'a22_effect_recorded_after_revoke_fails_gate' (9119291) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:0865d4b9404deba2e4180f8ca4557d91f354915fe28833d3a9d3fd896424e7ed: no verified grant event binds cap:f55a704b38cf52427ff68b7bbcd95ed12457bdc6003d4f365f9f4ab0ee65014a to this manifest (M7)

---- a22_pre_revoke_work_promotes_after_revoke stdout ----

thread 'a22_pre_revoke_work_promotes_after_revoke' (9119295) panicked at crates/asf-kernel/tests/gate.rs:1173:58:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:9fa0952f6b59726f1f98b6bad5d02933179373cf19109f58254f68774f291f23: no verified grant event binds cap:841b992414851a0d267bc3c69c4db964ac5fdf5e3d26c7d1a44ff88a9f4d25d6 to this manifest (M7)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.66s

*** result: Failure(101)
