*** crates/asf-kernel/src/broker.rs:879:5: replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([("xyzzy".into(), 1)])

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([("xyzzy".into(), 1)])
@@ -871,28 +871,17 @@
 /// A21/M7 activation view: the earliest verified grant offset for each
 /// capability bound to this manifest. Kept as a small pure helper so the
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
-    let mut grants = BTreeMap::new();
-    for ev in events {
-        if ev.span == substrate_span
-            && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
-        {
-            if let Some(cap) = ev.raw["body"]["capability"].as_str() {
-                grants.entry(cap.to_string()).or_insert(ev.offset);
-            }
-        }
-    }
-    grants
+    BTreeMap::from_iter([("xyzzy".into(), 1)]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve the capability claimed by one effect. Observed mode may carry an
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9124057) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:20d5dad709d01cc6e9ffff280a1f8db760bbdee53af1db344f9ab226072eb6ff: no verified grant event binds cap:d9aa1fcb2c0af6cc181d2e267dc28dcb24d053597d804464a77f0b07e633fb4e to this manifest (M7)

---- a22_parked_promotion_of_pre_revoke_work_remains_approvable stdout ----

thread 'a22_parked_promotion_of_pre_revoke_work_remains_approvable' (9124055) panicked at crates/asf-kernel/tests/gate.rs:1457:75:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:bc77ff25f9140c0555000ccb4a5fefd8da215763017fa36c21331fae2a9f9cb6: no verified grant event binds cap:ccd94eda4753a50c85dec35e05849fa07f0f67e1f155ee01fae856dc4d69e87d to this manifest (M7)")

---- a22_inflight_ticket_recorded_after_revoke_strands_branch stdout ----

thread 'a22_inflight_ticket_recorded_after_revoke_strands_branch' (9124053) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:1dedf0b17df2b9731f1cff9ba16356bcd33eb13ddbedc7195a2b31d14894a519: no verified grant event binds cap:157102acad477ff81a18e3f47e48970c5b624388a6817c7e8c5e5c0736824078 to this manifest (M7)

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.74s

*** result: Failure(101)
