*** crates/asf-kernel/src/broker.rs:879:5: replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([("xyzzy".into(), -1)])

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_grant_offsets -> BTreeMap<String, i64> with BTreeMap::from_iter([("xyzzy".into(), -1)])
@@ -871,28 +871,17 @@
 /// A21/M7 activation view: the earliest verified grant offset for each
 /// capability bound to this manifest. Kept as a small pure helper so the
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
-    let mut grants = BTreeMap::new();
-    for ev in events {
-        if ev.span == substrate_span
-            && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
-        {
-            if let Some(cap) = ev.raw["body"]["capability"].as_str() {
-                grants.entry(cap.to_string()).or_insert(ev.offset);
-            }
-        }
-    }
-    grants
+    BTreeMap::from_iter([("xyzzy".into(), -1)]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve the capability claimed by one effect. Observed mode may carry an
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,

---- a22_inflight_ticket_recorded_after_revoke_strands_branch stdout ----

thread 'a22_inflight_ticket_recorded_after_revoke_strands_branch' (9125571) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:fc4aa52e0614ed80dea3dc31c2f4f1f450440a3183b813af81d2a8baa14c73f1: no verified grant event binds cap:b5461b677e052bee9e61aa33f68f756e46eb707455a2b895a506a3ae13facb85 to this manifest (M7)

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9125575) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:f70081e5720bbc72ecf76c06deb6407d2c8d3265f8828fb9e1a75b8100429283: no verified grant event binds cap:9e32aeb71021d3e6f971b13445dd31ed8132871c2981aa6a41db9f1bcfb8d125 to this manifest (M7)

---- a22_parked_promotion_of_pre_revoke_work_remains_approvable stdout ----

thread 'a22_parked_promotion_of_pre_revoke_work_remains_approvable' (9125573) panicked at crates/asf-kernel/tests/gate.rs:1457:75:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:f25cac2ec1cd4dbe59c2fe66df97c3ad69e2cc22dab6974d1b6e62eb2f06e909: no verified grant event binds cap:6087357caf40a9aad78044cb41ec944d43cbfc2816d81b813d6fd118e5fe1a8b to this manifest (M7)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.81s

*** result: Failure(101)
