*** crates/asf-kernel/src/broker.rs:881:20: replace == with != in m7_grant_offsets

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace == with != in m7_grant_offsets
@@ -873,17 +873,17 @@
 /// authority-binding predicates have a stable mutation-testing target.
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
     let mut grants = BTreeMap::new();
     for ev in events {
-        if ev.span == substrate_span
+        if ev.span != /* ~ changed by cargo-mutants ~ */ substrate_span
             && ev.kind == "grant"
             && ev.manifest.as_deref() == Some(manifest_id)
         {
             if let Some(cap) = ev.raw["body"]["capability"].as_str() {
                 grants.entry(cap.to_string()).or_insert(ev.offset);
             }
         }
     }

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9133301) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:a80ca06bdc32899c6ed69f39d0d18169597442308d680ea282145ed1fb32aaeb: no verified grant event binds cap:614db1ce18dd2e663588393146d82c1c5081068f03d2788bb3dd91e2af931e9f to this manifest (M7)

---- a22_pre_revoke_work_promotes_after_revoke stdout ----

thread 'a22_pre_revoke_work_promotes_after_revoke' (9133300) panicked at crates/asf-kernel/tests/gate.rs:1173:58:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:e24542cc708c396d720c63388006bca5cf5c9c4764fb22d7d3af4b89c1cc09da: no verified grant event binds cap:1a2d0359a15020c0aa785a1b4c6f0ae7178af3b1bea4306f1da4ec27bde44460 to this manifest (M7)")

---- a22_inflight_ticket_recorded_after_revoke_strands_branch stdout ----

thread 'a22_inflight_ticket_recorded_after_revoke_strands_branch' (9133297) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:651ecd20e5577c7ec15c1455ece3f27699966f31c0db6cec9257e7d28c46ac26: no verified grant event binds cap:0575fd141f3c42cfdf5f4a04240bb279bb05758fbd3d1c243ee5415da8e9741d to this manifest (M7)

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 20 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 6.03s

*** result: Failure(101)
