*** crates/asf-kernel/src/broker.rs:882:13: replace && with || in m7_grant_offsets

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace && with || in m7_grant_offsets
@@ -874,17 +874,17 @@
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
     let mut grants = BTreeMap::new();
     for ev in events {
         if ev.span == substrate_span
-            && ev.kind == "grant"
+            || /* ~ changed by cargo-mutants ~ */ ev.kind == "grant"
             && ev.manifest.as_deref() == Some(manifest_id)
         {
             if let Some(cap) = ev.raw["body"]["capability"].as_str() {
                 grants.entry(cap.to_string()).or_insert(ev.offset);
             }
         }
     }
     grants

---- m7_grant_for_other_manifest_cannot_activate_capability stdout ----

thread 'm7_grant_for_other_manifest_cannot_activate_capability' (9131128) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:753e99a32a64f8297004b7e032a8912eb2cdd86eccefc92b10ea1bd6da2ff3a9: no verified grant binds cap:705864178d100ca1af5722328c8949b445e7d2c2fe37ad4fb2a6262b3392e2d3 to man:e5b81149aacf8a2fffa92a1c3c4e6e5bc73ce2a28e1689952d4d13a277c3c59b (A21/M7, fail closed)

---- m7_non_grant_event_cannot_activate_capability stdout ----

thread 'm7_non_grant_event_cannot_activate_capability' (9131237) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:07b2533a218b7cee973e263e813bf70df96b9291cb1065e144b22bd33ab710ee: no verified grant binds cap:88c9759af81c42c407b4693b30a301e6b297930f3e8e8c5867ebab518c07b272 to man:0246a0b8b4db26528c448615e60d2f7a58a95927d3c84651024d016ea6d257b3 (A21/M7, fail closed)

failures:
    m7_grant_for_other_manifest_cannot_activate_capability
    m7_non_grant_event_cannot_activate_capability

test result: FAILED. 33 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.47s

*** result: Failure(101)
