*** crates/asf-kernel/src/broker.rs:882:24: replace == with != in m7_grant_offsets

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace == with != in m7_grant_offsets
@@ -874,17 +874,17 @@
 fn m7_grant_offsets(
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
     let mut grants = BTreeMap::new();
     for ev in events {
         if ev.span == substrate_span
-            && ev.kind == "grant"
+            && ev.kind != /* ~ changed by cargo-mutants ~ */ "grant"
             && ev.manifest.as_deref() == Some(manifest_id)
         {
             if let Some(cap) = ev.raw["body"]["capability"].as_str() {
                 grants.entry(cap.to_string()).or_insert(ev.offset);
             }
         }
     }
     grants

---- a22_parked_promotion_of_pre_revoke_work_remains_approvable stdout ----

thread 'a22_parked_promotion_of_pre_revoke_work_remains_approvable' (9133268) panicked at crates/asf-kernel/tests/gate.rs:1457:75:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:57db5c013db85727d17ea0b61c521c5fd9b21236933bab2c50d3f28f7c151aeb: no verified grant event binds cap:4d833dfedaa5cea264804a6b5b8ed7f88b27df7462f68750e264e8d318a690bf to this manifest (M7)")

---- a22_pre_revoke_work_promotes_after_revoke stdout ----

thread 'a22_pre_revoke_work_promotes_after_revoke' (9133269) panicked at crates/asf-kernel/tests/gate.rs:1173:58:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:ee782bf34f8576133aa0c956ffa7624048d46b4fda0c485cc0ebb3d187e6956b precedes the grant of cap:6e6afd7f726473cd512f4afeea78925c3495377a5431dc15a9d69803afd4c6c4 (M7 ordering)")

---- a22_anomalous_manifest_revoke_still_closes_loudly stdout ----

thread 'a22_anomalous_manifest_revoke_still_closes_loudly' (9133263) panicked at crates/asf-kernel/tests/gate.rs:1381:59:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:524a7301690f006c19c07f8615dce572edbe16b422f9d588e04b4de5b7ed25a9 precedes the grant of cap:f344d53433ac7c49741bb7c07026a41f4ae4c5ecb8d2e15c0a16d83e03b5ca6a (M7 ordering)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean
    m7_brokered_manifest_rejects_unattributed_calls
    m7_brokered_run_with_two_grants_gates_clean
    m7_grant_after_effect_does_not_retroactively_authorize

test result: FAILED. 22 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 6.27s

*** result: Failure(101)
