*** crates/asf-kernel/src/broker.rs:883:13: replace && with || in m7_grant_offsets

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace && with || in m7_grant_offsets
@@ -875,17 +875,17 @@
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
     let mut grants = BTreeMap::new();
     for ev in events {
         if ev.span == substrate_span
             && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
+            || /* ~ changed by cargo-mutants ~ */ ev.manifest.as_deref() == Some(manifest_id)
         {
             if let Some(cap) = ev.raw["body"]["capability"].as_str() {
                 grants.entry(cap.to_string()).or_insert(ev.offset);
             }
         }
     }
     grants
 }

---- m7_grant_for_other_manifest_cannot_activate_capability stdout ----

thread 'm7_grant_for_other_manifest_cannot_activate_capability' (9128858) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:4e7388fa625d5b9fb8f7992ab0df3d22a86329b686a140932440dae800dc0555: no verified grant binds cap:bcfeab036ba7e162ae7ef050581d02962305fa19bc80604a7f8677be65be94a6 to man:0ee459fd965776d5c2a7fc27ecdff171852c31bb8d458ce0568420f8bfe47e24 (A21/M7, fail closed)

---- m7_non_grant_event_cannot_activate_capability stdout ----

thread 'm7_non_grant_event_cannot_activate_capability' (9128865) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:536f9a93e7cc7419c0a727c7da1209916a437ff5838288ad3892e2f607b5ee84: no verified grant binds cap:27bf26fa8557f91041134109b2f4000ef472395529642891b36e0bfb606bef9b to man:65f2b15cb7f20bfc4cfd92c78ec1db07954039104ad455fae2905d4d09f6d6fa (A21/M7, fail closed)

failures:
    m7_grant_for_other_manifest_cannot_activate_capability
    m7_non_grant_event_cannot_activate_capability

test result: FAILED. 33 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.07s

*** result: Failure(101)
