*** crates/asf-kernel/src/broker.rs:883:39: replace == with != in m7_grant_offsets

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace == with != in m7_grant_offsets
@@ -875,17 +875,17 @@
     events: &[trace::EventRow],
     substrate_span: &str,
     manifest_id: &str,
 ) -> BTreeMap<String, i64> {
     let mut grants = BTreeMap::new();
     for ev in events {
         if ev.span == substrate_span
             && ev.kind == "grant"
-            && ev.manifest.as_deref() == Some(manifest_id)
+            && ev.manifest.as_deref() != /* ~ changed by cargo-mutants ~ */ Some(manifest_id)
         {
             if let Some(cap) = ev.raw["body"]["capability"].as_str() {
                 grants.entry(cap.to_string()).or_insert(ev.offset);
             }
         }
     }
     grants
 }

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9134752) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:3a2d092dcb0d70e41a2f3a670d02a7afb84fa5ab27bc2bf4059b4bd16a63b228: no verified grant event binds cap:845cb92fc8e56f6c23b4a4d66606b1dce273c7013e478c7a8d010a9c77719be6 to this manifest (M7)

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9134761) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:6888ed02ea8ae2729aeb3a979d4abd4c612f40e96effe98dd825ac6248fbbc8a: no verified grant event binds cap:4e00fc38f9087c1f0ce835050e71a37f37d88599ff41232363789ad1eed3b451 to this manifest (M7)

---- a22_inflight_ticket_recorded_after_revoke_strands_branch stdout ----

thread 'a22_inflight_ticket_recorded_after_revoke_strands_branch' (9134757) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:0b4cefeaf80dcae9cbb7d412ad1f0ace450668fbe3ad781571ac7887f0e7229a: no verified grant event binds cap:7aa69855c13224283c3c15d18c6691e6db7c3650a5a731202f631b534eb157d0 to this manifest (M7)

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 19 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.19s

*** result: Failure(101)
