*** crates/asf-kernel/src/broker.rs:902:5: replace m7_effect_capability -> Result<Option<&'a str>, String> with Ok(None)

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_effect_capability -> Result<Option<&'a str>, String> with Ok(None)
@@ -894,27 +894,17 @@
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,
     body: &'a Value,
     effect_id: &str,
 ) -> Result<Option<&'a str>, String> {
-    let Some(cap_id) = body["summary"]["capability"].as_str() else {
-        return if brokered {
-            Err(format!(
-                "event {effect_id} has no capability attribution under brokered authority (M7)"
-            ))
-        } else {
-            Ok(None)
-        };
-    };
-
-    Ok(Some(cap_id))
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A21 activation check for a capability that already passed signature and
 /// M2 verification. The grant for this manifest must precede the effect.
 fn m7_verify_grant(
     brokered: bool,
     cap_id: &str,
     effect_id: &str,

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9135999) panicked at crates/asf-kernel/tests/gate.rs:320:18:
invalid grant lineage must fail closed: Ok(Applied { event: "evt:e23ef16bdf991b5303b1df4dae0392904f28bb37d51e84ae0f9f7d3625b845e8" })

---- a22_non_grant_event_cannot_activate_capability_in_observed_mode stdout ----

thread 'a22_non_grant_event_cannot_activate_capability_in_observed_mode' (9135996) panicked at crates/asf-kernel/tests/gate.rs:320:18:
invalid grant lineage must fail closed: Ok(Applied { event: "evt:fce3bf16b6b246bde82bb5a5d86d563feb3b4d87eb7b63e10b09601b91c3fc89" })

---- a22_inflight_ticket_recorded_after_revoke_strands_branch stdout ----

thread 'a22_inflight_ticket_recorded_after_revoke_strands_branch' (9135995) panicked at crates/asf-kernel/tests/gate.rs:320:18:
invalid grant lineage must fail closed: Ok(Applied { event: "evt:780919d143b35bf779ba8d47fc1c17f42c4ba017f8fedd141bf2a818fca659cc" })

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_non_grant_event_cannot_activate_capability_in_observed_mode
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    gate_blocks_run_that_exceeded_its_token
    gate_catches_time_violation_the_decision_evaluator_missed
    gate_fails_closed_on_unresolvable_capability_attribution
    gate_rejects_call_attributed_to_another_manifests_capability
    gate_rejects_undeclared_action_in_trace

test result: FAILED. 18 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.28s

*** result: Failure(101)
