*** crates/asf-kernel/src/broker.rs:902:5: replace m7_effect_capability -> Result<Option<&'a str>, String> with Ok(Some(""))

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_effect_capability -> Result<Option<&'a str>, String> with Ok(Some(""))
@@ -894,27 +894,17 @@
 /// unattributed effect; brokered mode may not. Grant ordering is checked only
 /// after the claimed capability has passed signature and M2 verification, so a
 /// cross-manifest substitution retains the more precise lineage failure.
 fn m7_effect_capability<'a>(
     brokered: bool,
     body: &'a Value,
     effect_id: &str,
 ) -> Result<Option<&'a str>, String> {
-    let Some(cap_id) = body["summary"]["capability"].as_str() else {
-        return if brokered {
-            Err(format!(
-                "event {effect_id} has no capability attribution under brokered authority (M7)"
-            ))
-        } else {
-            Ok(None)
-        };
-    };
-
-    Ok(Some(cap_id))
+    Ok(Some("")) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A21 activation check for a capability that already passed signature and
 /// M2 verification. The grant for this manifest must precede the effect.
 fn m7_verify_grant(
     brokered: bool,
     cap_id: &str,
     effect_id: &str,

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9139366) panicked at crates/asf-kernel/tests/gate.rs:320:18:
invalid grant lineage must fail closed: Err(Trace(ObjectNotFound("")))

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9139357) panicked at crates/asf-kernel/tests/gate.rs:320:18:
invalid grant lineage must fail closed: Err(Trace(ObjectNotFound("")))

---- a22_parked_promotion_of_pre_revoke_work_remains_approvable stdout ----

thread 'a22_parked_promotion_of_pre_revoke_work_remains_approvable' (9139364) panicked at crates/asf-kernel/tests/gate.rs:1457:75:
called `Result::unwrap()` on an `Err` value: Trace(ObjectNotFound(""))

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_non_grant_event_cannot_activate_capability_in_observed_mode
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing

test result: FAILED. 2 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 6.40s

*** result: Failure(101)
