*** crates/asf-kernel/src/broker.rs:924:5: replace m7_verify_grant -> Result<(), String> with Ok(())

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace m7_verify_grant -> Result<(), String> with Ok(())
@@ -916,28 +916,17 @@
 /// M2 verification. The grant for this manifest must precede the effect.
 fn m7_verify_grant(
     brokered: bool,
     cap_id: &str,
     effect_id: &str,
     effect_offset: i64,
     grants: &BTreeMap<String, i64>,
 ) -> Result<(), String> {
-    if !brokered {
-        return Ok(());
-    }
-    match grants.get(cap_id) {
-        Some(grant_offset) if *grant_offset < effect_offset => Ok(()),
-        Some(_) => Err(format!(
-            "event {effect_id} precedes the grant of {cap_id} (M7 ordering)"
-        )),
-        None => Err(format!(
-            "event {effect_id}: no verified grant event binds {cap_id} to this manifest (M7)"
-        )),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---- A22/§5.4 closure: the pure event-derived authority view ------------
 //
 // One reconstruction shared verbatim by decision time (evaluated at the
 // current verified head) and gate replay (evaluated at each effect's
 // durable authorization offset — today the tool_call event itself).
 // Closure is a structural precondition in front of caveat evaluation,

---- m7_grant_for_other_manifest_cannot_activate_capability stdout ----

thread 'm7_grant_for_other_manifest_cannot_activate_capability' (9141289) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:a4003cc57c14f5e618cb474b8224ce8a792b076de45cb0668aa52643ebea5643: no verified grant binds cap:4dd09dc2c1f0c86c54f89b3e46a7fce2a295ee4087772cbec2e0c17580c0b5b8 to man:8377bd477120449b43422fa30233a8542ec34eec67ba291670b94f8ff61a87a9 (A21/M7, fail closed)

---- m7_capability_without_grant_is_inert stdout ----

thread 'm7_capability_without_grant_is_inert' (9141287) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:6db8e22e33e66bf0a1f5ea0e810017c8c57e2cd7f46eb19e4985fe724bcceac2: no verified grant binds cap:d56f583d3e9650b9413447840c5e610a5d9805af6d7012ec335159fab6c8617e to man:ec802f4380e15032903967a78f0763c74f9847702473dc6b2bc98fbb2baf1164 (A21/M7, fail closed)

---- m7_non_grant_event_cannot_activate_capability stdout ----

thread 'm7_non_grant_event_cannot_activate_capability' (9141291) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:c3777d2a0deb32113834526b908347ca17ad39558d09cd8e7bd00d3d7ad43e75: no verified grant binds cap:b3943494e6b9fac997e7511c006c2afeeff7253fa09eed7e5db66c7b0c10b170 to man:17fadfef238b99d402a8db7a6cd26fa5ecbb7fecc8b8d15fe4acb6fdaae4d745 (A21/M7, fail closed)

failures:
    m7_capability_without_grant_is_inert
    m7_grant_for_other_manifest_cannot_activate_capability
    m7_non_grant_event_cannot_activate_capability

test result: FAILED. 32 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.83s

*** result: Failure(101)
