*** crates/asf-kernel/src/broker.rs:924:8: delete ! in m7_verify_grant

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ delete ! in m7_verify_grant
@@ -916,17 +916,17 @@
 /// M2 verification. The grant for this manifest must precede the effect.
 fn m7_verify_grant(
     brokered: bool,
     cap_id: &str,
     effect_id: &str,
     effect_offset: i64,
     grants: &BTreeMap<String, i64>,
 ) -> Result<(), String> {
-    if !brokered {
+    if  /* ~ changed by cargo-mutants ~ */brokered {
         return Ok(());
     }
     match grants.get(cap_id) {
         Some(grant_offset) if *grant_offset < effect_offset => Ok(()),
         Some(_) => Err(format!(
             "event {effect_id} precedes the grant of {cap_id} (M7 ordering)"
         )),
         None => Err(format!(

---- a22_non_grant_event_cannot_activate_capability_in_observed_mode stdout ----

thread 'a22_non_grant_event_cannot_activate_capability_in_observed_mode' (9141486) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:35b284999830847de2c3db1221a3b01f4eb89de52d6ccde2d33f64a9125b7968: no verified grant event binds cap:673cde51af5fe83dc1d2a9fea3c70f498f470a93d3824a6a14718277c9860e58 to this manifest (M7)

---- m7_capability_without_grant_is_inert stdout ----

thread 'm7_capability_without_grant_is_inert' (9142267) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:391125587b6735a20f79ef3560990d42ecfa49feacf6a465d65a30ff5a33565a: no verified grant binds cap:7c0775d51b094aae78c659061098aa6a6230455abf81ecc8383e9c3b8d93b931 to man:8ecd3b49a6db1b7f1a81ee630915d8db7e2a20e43a95470bbc1675f37d36acab (A21/M7, fail closed)

---- m7_grant_for_other_manifest_cannot_activate_capability stdout ----

thread 'm7_grant_for_other_manifest_cannot_activate_capability' (9142382) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:ff2e3603a191b6bfb920b43b7447fd0c53579fb8fac7bceb78d1c0d775c08618: no verified grant binds cap:64c6f6f8617d9301211057a053b72a5aba84b81338974396121dd743d0e054a0 to man:c75e135a2781663aecb3ed0bb91fd81cf4c74468d8a13b423ec17f31ca8dc6c4 (A21/M7, fail closed)

failures:
    a22_non_grant_event_cannot_activate_capability_in_observed_mode
    m7_capability_without_grant_is_inert
    m7_grant_for_other_manifest_cannot_activate_capability
    m7_non_grant_event_cannot_activate_capability

test result: FAILED. 31 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.35s

*** result: Failure(101)
