*** crates/asf-kernel/src/broker.rs:928:31: replace match guard *grant_offset < effect_offset with false in m7_verify_grant

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace match guard *grant_offset < effect_offset with false in m7_verify_grant
@@ -920,17 +920,17 @@
     effect_id: &str,
     effect_offset: i64,
     grants: &BTreeMap<String, i64>,
 ) -> Result<(), String> {
     if !brokered {
         return Ok(());
     }
     match grants.get(cap_id) {
-        Some(grant_offset) if *grant_offset < effect_offset => Ok(()),
+        Some(grant_offset) if false /* ~ changed by cargo-mutants ~ */ => Ok(()),
         Some(_) => Err(format!(
             "event {effect_id} precedes the grant of {cap_id} (M7 ordering)"
         )),
         None => Err(format!(
             "event {effect_id}: no verified grant event binds {cap_id} to this manifest (M7)"
         )),
     }
 }

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9145678) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:e6d869954c576fbc3d222cd8fb551d51af79df2e744578d83c225d0433b6f017 precedes the grant of cap:f6c35f5504106b0b3cf310e40bb45e03aa4e5f5451b2604463bdb0a019b6d2b9 (M7 ordering)

---- a22_anomalous_manifest_revoke_still_closes_loudly stdout ----

thread 'a22_anomalous_manifest_revoke_still_closes_loudly' (9145680) panicked at crates/asf-kernel/tests/gate.rs:1381:59:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:cc5206f9b0a3b2ff6e08306a7a57ee56f16e6e138b593c4c0af3729ac7dbd664 precedes the grant of cap:918cfcd79e8c10b76fc738c80e63ef351dd1e541a653da9726ff08250f2b27f6 (M7 ordering)")

---- a22_pre_revoke_work_promotes_after_revoke stdout ----

thread 'a22_pre_revoke_work_promotes_after_revoke' (9145686) panicked at crates/asf-kernel/tests/gate.rs:1173:58:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:e14a8da1561da4867ae45f8922b2a7fea0bfaafc96878d0f7989b94f1bc6b3fb precedes the grant of cap:e1f61c3fdc5e8cd8ddbb05ed97df0a10f9951cd20d3e1bdadf97e85afa4467e3 (M7 ordering)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 21 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.87s

*** result: Failure(101)
