*** crates/asf-kernel/src/broker.rs:928:45: replace < with == in m7_verify_grant

*** mutation diff:
--- crates/asf-kernel/src/broker.rs
+++ replace < with == in m7_verify_grant
@@ -920,17 +920,17 @@
     effect_id: &str,
     effect_offset: i64,
     grants: &BTreeMap<String, i64>,
 ) -> Result<(), String> {
     if !brokered {
         return Ok(());
     }
     match grants.get(cap_id) {
-        Some(grant_offset) if *grant_offset < effect_offset => Ok(()),
+        Some(grant_offset) if *grant_offset == /* ~ changed by cargo-mutants ~ */ effect_offset => Ok(()),
         Some(_) => Err(format!(
             "event {effect_id} precedes the grant of {cap_id} (M7 ordering)"
         )),
         None => Err(format!(
             "event {effect_id}: no verified grant event binds {cap_id} to this manifest (M7)"
         )),
     }
 }

---- a22_ancestor_grants_must_be_well_ordered stdout ----

thread 'a22_ancestor_grants_must_be_well_ordered' (9147273) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:b56f26bddad797ee422b36012b9058961d37690cf9d09db4590d63c92aa45ab8 precedes the grant of cap:58dadf59d2dd5882d7596e3c1da4e822f73b582e8a57b9a9ca499a90366b5bd0 (M7 ordering)

---- a22_revoked_before_first_grant_is_dead stdout ----

thread 'a22_revoked_before_first_grant_is_dead' (9147282) panicked at crates/asf-kernel/tests/gate.rs:318:13:
event evt:aca613eb1f9fb47a562d96f0c59d05d3f96662cc89dd822b6ea0876c8d3afd34 precedes the grant of cap:14ceccc91f01dc13ca3dd0b9929be143c6612d0b89569bb882e1d168c10f89d8 (M7 ordering)

---- a22_parked_promotion_of_pre_revoke_work_remains_approvable stdout ----

thread 'a22_parked_promotion_of_pre_revoke_work_remains_approvable' (9147280) panicked at crates/asf-kernel/tests/gate.rs:1457:75:
called `Result::unwrap()` on an `Err` value: GateTraceViolation("event evt:fab1dad41167d4cbb04b07c81f9eedc8f0751c43fd5b4c88d153ab6dd4745139 precedes the grant of cap:9915c9d9605af2c9405cccf5cfb64cc97e0ad2a6cf2bff1ae471e6773a3bad22 (M7 ordering)")

failures:
    a22_ancestor_grants_must_be_well_ordered
    a22_ancestor_revoke_closes_cross_manifest_child
    a22_anomalous_manifest_revoke_still_closes_loudly
    a22_child_revoke_leaves_parent_promotable
    a22_effect_recorded_after_revoke_fails_gate
    a22_inflight_ticket_recorded_after_revoke_strands_branch
    a22_parked_promotion_of_pre_revoke_work_remains_approvable
    a22_pre_revoke_work_promotes_after_revoke
    a22_revoked_before_first_grant_is_dead
    a22_same_id_regrant_cannot_reactivate
    a22_unsigned_revocation_row_moves_nothing
    m7_brokered_end_to_end_gates_clean

test result: FAILED. 21 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.51s

*** result: Failure(101)
